#pip install pandas
#pip install openxlpy

import pandas as pd
pd.set_option("display.max_rows", None)    #設定最大能顯示1000rows
pd.set_option("display.max_columns", None) #設定最大能顯示1000columns
pd.set_option('display.width', 180) # 设置打印宽度 
pd.set_option('display.max_colwidth', 0)
pd.set_option("display.colheader_justify","center") #抬頭對齊用
pd.set_option('display.unicode.ambiguous_as_wide', True) #抬頭對齊用
pd.set_option('display.unicode.east_asian_width', True) #抬頭對齊用

df = pd.read_excel("//192.168.50.61/f2-cnc報表/CNC刀具管控紀錄/111年刀具庫存表.xlsx.xlsm")


def tool_type(x): # x 等於刀具類別
	if x == '1':
		if y == "" or y == '0':
			result = df.loc[(df['類別'] == '平刀'),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
		#result = df.loc[(df['類別'] == '平刀')&(df['直徑'] >= z), ['直徑', '規格', '目前庫存數', '品名']].sort_values(by = '直徑')  #單尺寸篩選
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
		else:
			result = df.loc[(df['類別'] == '平刀')&(df['直徑'] <= float(y))&(df['直徑'] >= float(z)),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')

	elif x == '2':
		if y == "" or y == '0':
			result = df.loc[(df['類別'] == '球刀'),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
		else:
			result = df.loc[(df['類別'] == '球刀')&(df['直徑'] <= float(y))&(df['直徑'] >= float(z)),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
	elif x == '3':
		if y == "" or y == '0':
			result = df.loc[(df['類別'] == '圓鼻刀'),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
		else:
			result = df.loc[(df['類別'] == '圓鼻刀')&(df['直徑'] <= float(y))&(df['直徑'] >= float(z)),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
	elif x == '4':
		if y == "" or y == '0':
			result = df.loc[(df['類別'] == 'T型刀'),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
		else:
			result = df.loc[(df['類別'] == 'T型刀')&(df['直徑'] <= float(y))&(df['直徑'] >= float(z)),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
	elif x == '5':
		if y == "" or y == '0':
			result = df.loc[(df['類別'] == '鑽頭'),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
		else:
			result = df.loc[(df['類別'] == '鑽頭')&(df['直徑'] <= float(y))&(df['直徑'] >= float(z)),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
	elif x == '6':
		if y == "" or y == '0':
			result = df.loc[(df['類別'] == '中心鑽'),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
		else:
			result = df.loc[(df['類別'] == '中心鑽')&(df['直徑'] <= float(y))&(df['直徑'] >= float(z)),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
	elif x == '7':
		if y == "" or y == '0':
			result = df.loc[(df['類別'] == '定點鑽'),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
		else:
			result = df.loc[(df['類別'] == '定點鑽')&(df['直徑'] <= float(y))&(df['直徑'] >= float(z)),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
	elif x == '8':
		if y == "" or y == '0':
			result = df.loc[(df['類別'] == '平底鑽'),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
		else:
			result = df.loc[(df['類別'] == '平底鑽')&(df['直徑'] <= float(y))&(df['直徑'] >= float(z)),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
	elif x == '9':
			result = df.loc[(df['類別'] == '攻牙刀'),['規格', '目前庫存數', '儲位','品名']]
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print('此項目列出為庫存所有規格')
			print(result)
			print('===============================================================================================')
	elif x == '10':
			result = df.loc[(df['類別'] == '護套攻牙刀'),['規格', '目前庫存數', '儲位','品名']]
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print('此項目列出為庫存所有規格')
			print(result)
			print('===============================================================================================')
	elif x == '11':
		if y == "" or y == '0':
			result = df.loc[(df['類別'] == '銑牙刀'),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
		else:
			result = df.loc[(df['類別'] == '銑牙刀')&(df['直徑'] <= float(y))&(df['直徑'] >= float(z)),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
	elif x == '12':
		if y == "" or y == '0':
			result = df.loc[(df['類別'] == '鉸刀'),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
		else:
			result = df.loc[(df['類別'] == '鉸刀')&(df['直徑'] <= float(y))&(df['直徑'] >= float(z)),['直徑', '規格', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print(result)
			print('===============================================================================================')
	elif x == '13':
			result = df.loc[(df['類別'] == '外R刀'),['規格', '目前庫存數', '儲位','品名']]
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print('此項目列出為庫存所有規格')
			print(result)
			print('===============================================================================================')

	elif x == '14':
			result = df.loc[(df['類別'] == '刀片'),['規格', '目前庫存數', '儲位','品名']]
			print('===============================================================================================')
			print('以下為查詢的刀具列表：')
			print('此項目列出為庫存所有規格')
			print(result)
			print('===============================================================================================')




while True:	
	print('===============================================================================================')
	print('1.平刀, 2.球刀, 3.圓鼻刀, 4.T型刀')
	print('')
	print('5.鑽頭, 6.中心鑽, 7.定點鑽, 8.平底鑽, 9.攻牙刀')
	print('')
	print('10.護套攻牙刀, 11.銑牙刀, 12.鉸刀, 13.外R刀, 14.刀片')
	print('')

#print("\n(2)第2行第3列的值：")
#print(df.iloc[1,2])
	# 指定欄位索引值
	print(df.iloc[0,30])
	print('')
	#print('此刀具庫表最後更新日為', df1)

	x = input('請輸入要查詢的刀具形式(1-14)： ')
	if x == "" or x == '0' :
		print('**************************輸入錯誤，請重新輸入***************************')
		print('**************************輸入錯誤，請重新輸入***************************')
		print('**************************輸入錯誤，請重新輸入***************************')
		continue
	y = input('請輸入要查詢的直徑範圍上限(數字)，或按輸入0顯示全部刀具： ')
	z = input('請輸入要查詢的直徑範圍下限(數字)： ')
	print('===============================================================================================')
	tool_type(x)
	continue
	
		
	# elif x !=int:
	# 	print('*******輸入錯誤請重新輸入*******')
	# 	break
	













# if x == '1':
# 	em = df.loc[(df['類別'] == '攻牙刀')&(df['直徑'] < int(y)), ['直徑', '規格', '目前庫存數', '品名']].sort_values(by = '直徑')
# 	#em.sort_values(by = '目前庫存數')
# 	print('以下為查詢的刀具庫存：')
# 	print(em)



#result = df.loc[(df['類別'] == '平刀')&(df['目前庫存數'] > A1), ['目前庫存數', '規格', '品名']]
		


#result = df.loc[(df['類別'] == '平刀') and(df['目前庫存數'] > A1), ['目前庫存數', '規格', '品名']]


#print(result)
 
#result.sort_values(by = '目前庫存數')

#print(result)