#pip install pandas
#pip install openxlpy

# 檔案大小
#filesize = os.path.getsize(filename)
#print(filesize)     # 字節數

# 檔案創建時間
#create_time = os.path.getctime(filename)        # 返回的是時間戳記
#print(datetime.datetime.fromtimestamp(create_time))

# 檔案最近讀取時間
#access_time = os.path.getatime(filename)
#print(access_time)

# 檔案最近修改時間
#modify_time = os.path.getmtime(filename)
#print(modify_time)


import pandas as pd
import os, sys

pd.set_option("display.max_rows", None)    #設定最大能顯示1000rows
pd.set_option("display.max_columns", None) #設定最大能顯示1000columns
pd.set_option('display.width', 180) # 設置打印寬度 
pd.set_option('display.max_colwidth', 0)
pd.set_option("display.colheader_justify","center") #抬頭對齊用
pd.set_option('display.unicode.ambiguous_as_wide', True) #抬頭對齊用
pd.set_option('display.unicode.east_asian_width', True) #抬頭對齊用

df = pd.read_excel("//192.168.50.61/f2-cnc報表/CNC刀具管控紀錄/111年刀具庫存表.xlsx.xlsm", index_col=6)




def tool_type(t_type): # t_type 等於刀具類別
	
	if t_type == '1':
		if t_max == "" or t_max == '0':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '平刀')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '平刀'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
		else:
			if display_oos == '0':
				result = df.loc[(df['類別'] == '平刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min))&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '平刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min)),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
	
	elif t_type == '2':
		if t_max == "" or t_max == '0':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '球刀')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '球刀'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
		else:
			if display_oos == '0':
				result = df.loc[(df['類別'] == '球刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min))&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '球刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min)),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
	
	elif t_type == '3':
		if t_max == "" or t_max == '0':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '圓鼻刀')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '圓鼻刀'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
		else:
			if display_oos == '0':
				result = df.loc[(df['類別'] == '圓鼻刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min))&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '圓鼻刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min)),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
	
	elif t_type == '4':
		if t_max == "" or t_max == '0':
			if display_oos == '0':
				result = df.loc[(df['類別'] == 'T型刀')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == 'T型刀'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
		else:
			if display_oos == '0':
				result = df.loc[(df['類別'] == 'T型刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min))&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == 'T型刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min)),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
	
	elif t_type == '5':
		if t_max == "" or t_max == '0':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '鑽頭')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '鑽頭'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
		else:
			if display_oos == '0':
				result = df.loc[(df['類別'] == '鑽頭')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min))&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '鑽頭')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min)),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
	
	elif t_type == '6':
		if t_max == "" or t_max == '0':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '中心鑽')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '中心鑽'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
		else:
			if display_oos == '0':
				result = df.loc[(df['類別'] == '中心鑽')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min))&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '中心鑽')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min)),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
	
	elif t_type == '7':
		if t_max == "" or t_max == '0':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '定點鑽')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '定點鑽'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
		else:
			if display_oos == '0':
				result = df.loc[(df['類別'] == '定點鑽')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min))&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '定點鑽')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min)),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
	
	elif t_type == '8':
		if t_max == "" or t_max == '0':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '平底鑽')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '平底鑽'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
		else:
			if display_oos == '0':
				result = df.loc[(df['類別'] == '平底鑽')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min))&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '平底鑽')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min)),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
	
	elif t_type == '9':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '攻牙刀')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '攻牙刀'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('此項目列出為庫存所有規格')
				print(result)
				print('')
				print('===============================================================================================')

	elif t_type == '10':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '護套攻牙刀')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '護套攻牙刀'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('此項目列出為庫存所有規格')
				print('')
				print('')
				print(result)
				print('')
				print('===============================================================================================')
	elif t_type == '11':
		if t_max == "" or t_max == '0':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '銑牙刀')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '銑牙刀'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
		else:
			if display_oos == '0':
				result = df.loc[(df['類別'] == '銑牙刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min))&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '銑牙刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min)),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
	elif t_type == '12':
		if t_max == "" or t_max == '0':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '鉸刀')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '鉸刀'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
		else:
			if display_oos == '0':
				result = df.loc[(df['類別'] == '鉸刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min))&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '鉸刀')&(df['直徑'] <= float(t_max))&(df['直徑'] >= float(t_min)),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑') #上下限篩選
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表：')
				print('')
				print(result)
				print('===============================================================================================')
	elif t_type == '13':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '外R刀')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '外R刀'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('此項目列出為庫存所有規格')
				print('')
				print(result)
				print('===============================================================================================')

	elif t_type == '14':
			if display_oos == '0':
				result = df.loc[(df['類別'] == '刀片')&(df['目前庫存數'] >= 1),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('以下為查詢的刀具列表    (***已過濾庫存為0的刀具***)：')
				print('')
				print(result)
				print('===============================================================================================')
			elif display_oos == '1' or display_oos == '':
				result = df.loc[(df['類別'] == '刀片'),['直徑', '目前庫存數', '儲位','品名']].sort_values(by = '直徑')
				print('===============================================================================================')
				print('')
				print('此項目列出為庫存所有規格')
				print('')
				print(result)
				print('===============================================================================================')


#查詢時間及刀具庫存最後修改時間
import os, datetime
from datetime import date
import time
from datetime import timedelta
filename = '//192.168.50.61/f2-cnc報表/CNC刀具管控紀錄/111年刀具庫存表.xlsx.xlsm'


# #刀具庫最近讀取時間
# access_time = os.path.getatime(filename)
# load_times = time.localtime(access_time)
# l_t = []
# times = time.localtime(access_time)
# for t in times:
# 	t = str(t)
# 	#x = t.split('\n')
# 	l_t.append(t)
# print('')
# print('')
# print('刀具表單最後讀取日期為: ', l_t[0] + '-' + l_t[1] + '-' + l_t[2] + '  ' + l_t[3]+ ':' + l_t[4])




# 刀具庫最近修改时间
modify_time = os.path.getmtime(filename)
#print(modify_time)
m_t = []
times = time.localtime(modify_time)
for t in times:
	t = str(t)
	#x = t.split('\n')
	m_t.append(t)



#今天日期
now = datetime.datetime.now(tz=datetime.timezone(timedelta(hours=8)))
print('目前要查詢庫存的時間為: ', now.strftime('%Y-%m-%d %H:%M:%S'))
#print(datetime.datetime.utcnow()) 另一種現在時間



#查詢系統
while True:	
	print('')
	print('')
	print('')	
	print('')
	print('')
	print('')	
	print('歡迎使用群旭科技_CNC部門_刀具庫存查詢系統 ver1.1')
	print('===============================================================================================')
	print('提醒您，查詢庫存與最終庫存會依表單更新日期有所落差')
	print('>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>')
	print('刀具表單最後更新日期為: ', m_t[0] + '-' + m_t[1] + '-' + m_t[2] + '  ' + m_t[3]+ ':' + m_t[4])
	print('>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>')
	print('===============================================================================================')
	print('1.平刀, 2.球刀, 3.圓鼻刀, 4.T型刀')
	print('')
	print('5.鑽頭, 6.中心鑽, 7.定點鑽, 8.平底鑽, 9.攻牙刀')
	print('')
	print('10.護套攻牙刀, 11.銑牙刀, 12.鉸刀, 13.外R刀, 14.刀片')
	print('')


	t_type = input('請輸入要查詢的刀具形式(1-14)： ')
	if t_type == "" or t_type == '0' :
		print('**************************輸入錯誤，請重新輸入***************************')
		print('**************************輸入錯誤，請重新輸入***************************')
		print('**************************輸入錯誤，請重新輸入***************************')
		continue
	elif t_type == "9" or t_type == '10' or t_type == '13' or t_type == '14' :
		display_oos = input('是否要顯示庫存為0的刀具 (1= 顯示,  0=不顯示): ') #無庫存 out of stock
		tool_type(t_type)
		continue
	t_max = input('請輸入要查詢的直徑範圍上限(數字)，或按輸入0顯示此類型全部刀具： ')
	if t_max == '0' :
		display_oos = input('是否要顯示庫存為0的刀具 (1= 顯示,  0=不顯示): ') #無庫存 out of stock
		tool_type(t_type)
		continue
	t_min = input('請輸入要查詢的直徑範圍下限(數字)： ')
	display_oos = input('是否要顯示庫存為0的刀具 (1= 顯示,  0=不顯示): ') #無庫存 out of stock
	print('===============================================================================================')
	tool_type(t_type)
	continue












# if x == '1':
# 	em = df.loc[(df['類別'] == '攻牙刀')&(df['直徑'] < int(y)), ['直徑', '規格', '目前庫存數', '品名']].sort_values(by = '直徑')
# 	#em.sort_values(by = '目前庫存數')
# 	print('以下為查詢的刀具庫存：')
# 	print(em)



#result = df.loc[(df['類別'] == '平刀')&(df['目前庫存數'] > A1), ['目前庫存數', '規格', '品名']]
		


#result = df.loc[(df['類別'] == '平刀') and(df['目前庫存數'] > A1), ['目前庫存數', '規格', '品名']]


#print(result)
 
#result.sort_values(by = '目前庫存數')

#print(result)